{
    "fireCalculator": "Calculadora FIRE",
    "financialIndependence": "Independência Financeira, Aposentadoria Antecipada",
    "basicData": "Dados Básicos",
    "basicDataTooltip": "Esta secção contém os pressupostos fundamentais para a simulação. Altere estes valores para refletir a sua realidade e objetivos.",
    "safeWithdrawalRate": "Taxa de Retirada Segura (%)",
    "safeWithdrawalRateTooltip": "A percentagem do seu património que planeia retirar anualmente na reforma. Tradicionalmente, 4% é um valor comum.",
    "estimatedAnnualInflation": "Inflação Anual Estimada (%)",
    "estimatedAnnualInflationTooltip": "A taxa de inflação média que espera ao longo do tempo. Isto é usado para calcular o valor real do seu dinheiro no futuro.",
    "currentAge": "Idade Atual",
    "currentAgeTooltip": "A sua idade atual. Isto serve como ponto de partida para a simulação.",
    "simulateUntilAge": "Simular até à Idade",
    "simulateUntilAgeTooltip": "A idade em que pretende que a simulação termine. Pode ser a sua idade de reforma desejada.",
    "annualIncome": "Rendimento Anual (€)",
    "annualIncomeTooltip": "O seu rendimento anual bruto. Este valor não é usado diretamente nos cálculos de património, mas é útil para referência.",
    "annualExpenses": "Despesas Anuais (€)",
    "annualExpensesTooltip": "As suas despesas anuais essenciais (custo de vida). Este é um dos valores mais importantes para calcular o seu número FIRE.",
    "alreadyInvestedValue": "Valor Já Investido (€)",
    "alreadyInvestedValueTooltip": "O montante total que já tem investido. Este é o ponto de partida do seu património.",
    "diversifiedDeposits": "Depósitos Diversificados",
    "diversifiedDepositsTooltip": "Adicione aqui todos os seus investimentos mensais recorrentes. A calculadora usará a média ponderada da taxa de retorno para a simulação.",
    "investmentType": "Tipo Investimento",
    "monthlyValue": "Valor Mensal (€)",
    "expectedRate": "Taxa Esperada (%)",
    "standardDeviation": "Desvio Padrão (%)",
    "startDate": "Data Início",
    "endDate": "Data Fim",
    "description": "Descrição",
    "actions": "Ações",
    "chooseTemplate": "Escolher um template...",
    "default": "Padrão",
    "conservative": "Conservador",
    "moderate": "Moderado",
    "aggressive": "Agressivo",
    "custom": "Personalizados",
    "saveAsTemplate": "Salvar como Template",
    "addDeposit": "Adicionar Depósito",
    "weightedReturnRate": "Taxa de Retorno Ponderada:",
    "investmentTypeTooltip": "Ex: ETF Global, Ações, PPR, Cripto. Um nome que identifique este tipo de investimento.",
    "monthlyValueTooltip": "O montante que planeia investir neste ativo todos os meses.",
    "expectedRateTooltip": "A taxa de retorno anual que espera para este ativo. Seja realista (ex: 7-8% para um ETF global).",
    "standardDeviationTooltip": "Mede a volatilidade do ativo. Um valor mais alto significa maior risco e incerteza. Ex: um ETF global pode ter 15-18%.",
    "startDateTooltip": "A data em que começa a fazer estes depósitos mensais.",
    "endDateTooltip": "A data em que planeia parar de fazer estes depósitos.",
    "descriptionTooltip": "Uma breve descrição para sua referência (ex: o nome do ETF como VWCE).",
    "save": "Salvar",
    "cancel": "Cancelar",
    "uniqueFinancialEvents": "Eventos Financeiros Únicos",
    "uniqueFinancialEventsTooltip": "Registe aqui entradas ou saídas de dinheiro que acontecem apenas uma vez, como uma herança, um bónus grande ou a entrada para uma casa.",
    "year": "Ano",
    "month": "Mês",
    "type": "Tipo",
    "value": "Valor (€)",
    "addEvent": "Adicionar Evento",
    "yearTooltip": "O ano em que este evento financeiro único irá ocorrer.",
    "monthTooltip": "O mês em que este evento financeiro único irá ocorrer.",
    "eventTypeTooltip": "\"Depósito\" para uma entrada de dinheiro (ex: herança, bónus). \"Levantamento\" para uma saída (ex: compra de carro, viagem).",
    "eventValueTooltip": "O montante total deste evento financeiro.",
    "eventDescriptionTooltip": "Uma breve descrição para sua referência (ex: \"Entrada para casa nova\").",
    "january": "Janeiro",
    "february": "Fevereiro",
    "march": "Março",
    "april": "Abril",
    "may": "Maio",
    "june": "Junho",
    "july": "Julho",
    "august": "Agosto",
    "september": "Setembro",
    "october": "Outubro",
    "november": "Novembro",
    "december": "Dezembro",
    "deposit": "Depósito",
    "withdrawal": "Levantamento",
    "recurringFinancialEvents": "Eventos Financeiros Recorrentes",
    "recurringFinancialEventsTooltip": "Para entradas ou saídas de dinheiro que ocorrem com uma frequência diferente da mensal (ex: um bónus anual ou um seguro pago semestralmente).",
    "startEndYear": "Ano Início-Fim",
    "periodicity": "Periodicidade",
    "valuePerPeriod": "Valor/Período (€)",
    "startYearTooltip": "O ano em que este evento recorrente começa a ter efeito.",
    "endYearTooltip": "O ano em que este evento recorrente deixa de ter efeito.",
    "recurringEventTypeTooltip": "\"Depósito\" para uma entrada de dinheiro recorrente (ex: renda de um imóvel). \"Levantamento\" para uma saída (ex: subscrição anual).",
    "periodicityTooltip": "A frequência com que este evento ocorre (Mensal, Trimestral, Semestral, Anual).",
    "valuePerPeriodTooltip": "O montante de dinheiro envolvido em cada ocorrência deste evento.",
    "recurringEventDescriptionTooltip": "Uma breve descrição para sua referência (ex: \"Renda do apartamento\").",
    "monthly": "Mensal",
    "quarterly": "Trimestral",
    "semiAnnually": "Semestral",
    "annually": "Anual",
    "variableExpenses": "Despesas Variáveis",
    "variableExpensesTooltip": "Adicione aqui despesas significativas que têm uma data de início e de fim, como o crédito da casa ou as despesas com a educação dos filhos.",
    "monthlyValueExpense": "Valor Mensal (€)",
    "addExpense": "Adicionar Despesa",
    "expenseDescriptionTooltip": "Uma descrição para a despesa (ex: \"Crédito Habitação\", \"Creche\").",
    "monthlyValueExpenseTooltip": "O custo mensal desta despesa.",
    "startYearExpenseTooltip": "O ano em que esta despesa começa.",
    "endYearExpenseTooltip": "O ano em que esta despesa termina.",
    "startYear": "Ano Início",
    "endYear": "Ano Fim",
    "results": "Resultados",
    "resultsTooltip": "Aqui são apresentados os principais resultados da simulação determinística, que assume que as taxas de retorno são constantes.",
    "fireValueRequired": "Valor FIRE Necessário",
    "fireAge": "Idade FIRE",
    "effectiveNominalReturnRate": "Taxa Retorno Efetiva Nominal",
    "effectiveRealReturnRate": "Taxa Retorno Efetiva Real",
    "monteCarloSimulationResults": "Resultados da Simulação de Monte Carlo",
    "monteCarloSimulationTooltip": "Esta simulação testa a robustez do seu plano usando volatilidade. Executa o plano centenas de vezes com retornos variáveis para ver a probabilidade de sucesso.",
    "numberOfSimulations": "Número de Simulações",
    "numberOfSimulationsTooltip": "O número de vezes que a simulação será executada. Mais simulações dão um resultado estatisticamente mais robusto, mas demoram mais tempo. 1000 a 5000 é um bom intervalo.",
    "pessimisticAssets": "Património (Pessimista - P10)",
    "medianAssets": "Património (Mediano - P50)",
    "optimisticAssets": "Património (Otimista - P90)",
    "successRate": "Taxa de Sucesso",
    "optimisticRetirementAge": "Idade de Reforma (Otimista - P10)",
    "medianRetirementAge": "Idade de Reforma (Mediana - P50)",
    "pessimisticRetirementAge": "Idade de Reforma (Pessimista - P90)",
    "retirementAgeExplanation": "Explicação",
    "sensitivityAnalysis": "Análise de Sensibilidade",
    "sensitivityAnalysisTooltip": "Esta análise mostra como a sua idade FIRE pode variar com pequenas alterações nos seus pressupostos de retorno e inflação.",
    "sensitivityAnalysisDescription": "Esta análise mostra como a sua Idade FIRE pode variar com pequenas alterações nos seus pressupostos de retorno e inflação.",
    "scenario": "Cenário",
    "resultingFireAge": "Idade FIRE Resultante",
    "sequenceOfReturnsRiskAnalysis": "Análise de Risco de Sequência de Retornos",
    "sequenceOfReturnsRiskTooltip": "Esta análise simula o impacto de uma crise de mercado no início da sua reforma para testar a robustez do seu plano.",
    "scenarioDuration": "Duração do Cenário (Anos)",
    "annualReturnInScenario": "Retorno Anual no Cenário (%)",
    "simulateSequenceRisk": "Simular Risco de Sequência",
    "assetEvolution": "Evolução Patrimonial",
    "assetEvolutionTooltip": "Este gráfico mostra a projeção do crescimento do seu património ao longo do tempo, tanto em valor nominal (o valor real) como em valor real (ajustado à inflação).",
    "filterChartPeriod": "Filtrar período do gráfico",
    "all": "Tudo",
    "granularity": "Granularidade",
    "annual": "Anual",
    "monthly": "Mensal",
    "expenseEvolution": "Evolução das Despesas",
    "expenseEvolutionTooltip": "Este gráfico mostra como as suas despesas totais (fixas + variáveis) evoluem ao longo do tempo, permitindo-lhe visualizar quando grandes despesas terminam.",
    "assetDistribution": "Distribuição de Ativos",
    "assetDistributionTooltip": "Este gráfico mostra a percentagem que cada um dos seus depósitos mensais representa do total investido, dando-lhe uma visão da sua alocação de ativos.",
    "calculateProjection": "Calcular Projeção",
    "calculateMonteCarlo": "Calcular Monte Carlo",
    "downloadPDFReport": "Baixar Relatório PDF",
    "exportData": "Exportar Dados",
    "importData": "Importar Dados",
    "footerText": "2025 Calculadora FIRE by NearDaniel",
    "edit": "Editar",
    "remove": "Remover",
    "update": "Atualizar",
    "confirmAddTemplate": "Deseja adicionar os depósitos do template à sua lista existente? \n\nOK = Adicionar \nCancelar = Substituir a lista atual",
    "promptTemplateName": "Digite um nome para o seu novo template de investimentos:",
    "errorEmptyTemplateName": "O nome do template não pode estar vazio.",
    "errorTemplateNameExists": "Já existe um template com esse nome. Por favor, escolha outro.",
    "errorNoDepositsToSave": "Não existem depósitos na lista para salvar como um template.",
    "successTemplateSaved": "Template \"{templateName}\" salvo com sucesso!",
    "successDataImported": "Dados importados com sucesso!",
    "errorInvalidDataFile": "Arquivo de dados inválido.",
    "errorReadingDataFile": "Erro ao ler o arquivo de dados.",
    "basicDataInfo": "Esta secção abrange os pressupostos fundamentais para a sua projeção FIRE. Defina a sua idade, a taxa de retirada segura desejada e os seus dados financeiros atuais para começar.",
    "diversifiedDepositsInfo": "Liste aqui os seus investimentos mensais recorrentes. Pode adicionar diferentes tipos de ativos, como ETFs, ações ou PPRs, cada um com a sua taxa de retorno esperada e desvio padrão para simulações de Monte Carlo.",
    "uniqueFinancialEventsInfo": "Registe aqui eventos financeiros únicos que irão impactar o seu património, como uma herança, um grande bónus, ou a entrada para a compra de uma casa. Podem ser depósitos ou levantamentos.",
    "recurringFinancialEventsInfo": "Adicione eventos financeiros que ocorrem regularmente durante um determinado período, mas não mensalmente. Por exemplo, um bónus anual, o pagamento de um seguro, ou uma renda de um imóvel.",
    "variableExpensesInfo": "Esta secção permite-lhe adicionar despesas significativas que não fazem parte do seu orçamento anual base, mas que ocorrem durante um período específico. Por exemplo, a prestação de um carro ou as propinas da universidade de um filho.",
    "resultsInfo": "Esta secção apresenta os principais resultados da simulação determinística, que assume que as taxas de retorno são constantes ao longo do tempo.",
    "monteCarloSimulationInfo": "Esta simulação testa a robustez do seu plano contra a volatilidade do mercado. Executa o plano milhares de vezes com retornos variáveis para avaliar a probabilidade de sucesso.",
    "assetEvolutionInfo": "Este gráfico mostra a projeção do crescimento do seu património ao longo do tempo, tanto em valor nominal (o montante real) como em valor real (ajustado à inflação).",
    "expenseEvolutionInfo": "Este gráfico mostra como as suas despesas totais (base + variáveis) evoluem ao longo do tempo, permitindo-lhe visualizar quando grandes despesas terminam.",
    "assetDistributionInfo": "Este gráfico mostra a percentagem que cada um dos seus depósitos mensais representa do total investido, dando-lhe uma visão clara da sua alocação de ativos."
}